In [2]:
import pandas as pd

In [4]:
df1 = pd.DataFrame()

In [6]:
df1

Empty DataFrame
Columns: []
Index: []

In [7]:
type(df1)

pandas.core.frame.DataFrame

In [8]:
dct1 = {'identificacao' : [1,2,3],
        'nome':['luiz','henrique','valencio']       
       }

In [19]:
dct1

{'identificacao': [1, 2, 3], 'nome': ['luiz', 'henrique', 'valencio']}

In [26]:
df2 = pd.DataFrame(data = dct1, index = [11,12,13] )

In [27]:
df2

    identificacao      nome
11              1      luiz
12              2  henrique
13              3  valencio

In [28]:
s1 = pd.Series(['a','b','c'])
s2 = pd.Series(['aa','bb','cc'])

In [29]:
df3 = pd.DataFrame({'coluna1': s1,
                    'coluna2': s2
                   })

In [30]:
df3

  coluna1 coluna2
0       a      aa
1       b      bb
2       c      cc

In [31]:
df3['coluna3'] = 0

In [32]:
df3

  coluna1 coluna2  coluna3
0       a      aa        0
1       b      bb        0
2       c      cc        0

In [33]:
df3['index'] = 0

In [34]:
df3.coluna1

0    a
1    b
2    c
Name: coluna1, dtype: object

In [35]:
df3.dtypes

coluna1    object
coluna2    object
coluna3     int64
index       int64
dtype: object

In [36]:
df3.coluna1 = df3.coluna1.astype(str)

In [37]:
df3.dtypes

coluna1    object
coluna2    object
coluna3     int64
index       int64
dtype: object

In [39]:
df3['teste1'] = [None,2,3]

In [40]:
df3

  coluna1 coluna2  coluna3  index  teste1
0       a      aa        0      0     NaN
1       b      bb        0      0     2.0
2       c      cc        0      0     3.0

In [41]:
df3.dtypes

coluna1     object
coluna2     object
coluna3      int64
index        int64
teste1     float64
dtype: object

In [42]:
df3.columns

Index(['coluna1', 'coluna2', 'coluna3', 'index', 'teste1'], dtype='object')

In [43]:
df3.shape

(3, 5)

In [44]:
df3.values

array([['a', 'aa', 0, 0, nan],
       ['b', 'bb', 0, 0, 2.0],
       ['c', 'cc', 0, 0, 3.0]], dtype=object)

In [50]:
df100 = df3.copy()

In [51]:
df100

  coluna1 coluna2  coluna3  index  teste1
0       a      aa        0      0     NaN
1       b      bb        0      0     2.0
2       c      cc        0      0     3.0

In [52]:
df100.count()

coluna1    3
coluna2    3
coluna3    3
index      3
teste1     2
dtype: int64

In [53]:
df100.drop(columns = ['index'], inplace = True)

In [54]:
df100

  coluna1 coluna2  coluna3  teste1
0       a      aa        0     NaN
1       b      bb        0     2.0
2       c      cc        0     3.0

In [55]:
df100.drop(index = [2], inplace = True)

In [56]:
df100

  coluna1 coluna2  coluna3  teste1
0       a      aa        0     NaN
1       b      bb        0     2.0

In [59]:
df101 = pd.concat([df100,df100,df100,df100])

In [60]:
df101

  coluna1 coluna2  coluna3  teste1
0       a      aa        0     NaN
1       b      bb        0     2.0
0       a      aa        0     NaN
1       b      bb        0     2.0
0       a      aa        0     NaN
1       b      bb        0     2.0
0       a      aa        0     NaN
1       b      bb        0     2.0

In [61]:
df101.drop_duplicates(inplace = True)

In [66]:
df101

  coluna1 coluna2  coluna3  teste1
0       a      aa        0     NaN
1       b      bb        0     2.0

In [63]:
df102 = pd.concat([df100,df100,df100,df100])

In [64]:
df102.dropna(inplace = True)

In [65]:
df102

  coluna1 coluna2  coluna3  teste1
1       b      bb        0     2.0
1       b      bb        0     2.0
1       b      bb        0     2.0
1       b      bb        0     2.0

In [72]:
df101 = pd.concat([df100,df100,df100,df100])

In [73]:
df101.fillna('NULL', inplace = True)

In [74]:
df101

  coluna1 coluna2  coluna3 teste1
0       a      aa        0   NULL
1       b      bb        0    2.0
0       a      aa        0   NULL
1       b      bb        0    2.0
0       a      aa        0   NULL
1       b      bb        0    2.0
0       a      aa        0   NULL
1       b      bb        0    2.0

In [75]:
df101.head(2)

  coluna1 coluna2  coluna3 teste1
0       a      aa        0   NULL
1       b      bb        0    2.0

In [77]:
df101.tail(1)

  coluna1 coluna2  coluna3 teste1
1       b      bb        0    2.0

In [78]:
## Exemplo de group by: df.groupby(['listaColunas']).colunaQueVaiSomar.sum()

In [80]:
df101.groupby('coluna2').coluna2.count()

coluna2
aa    4
bb    4
Name: coluna2, dtype: int64

In [81]:
df101

  coluna1 coluna2  coluna3 teste1
0       a      aa        0   NULL
1       b      bb        0    2.0
0       a      aa        0   NULL
1       b      bb        0    2.0
0       a      aa        0   NULL
1       b      bb        0    2.0
0       a      aa        0   NULL
1       b      bb        0    2.0

In [85]:
df101[df101.coluna2.isin(['aa']) == True]

  coluna1 coluna2  coluna3 teste1
0       a      aa        0   NULL
0       a      aa        0   NULL
0       a      aa        0   NULL
0       a      aa        0   NULL

In [86]:
## Filtrar not null df[df.nomeColua.notnull() == True]

In [93]:
#mudando o nome da coluba

df101.rename(columns = {'coluna1': 'nomeNovo'}, inplace=True)

In [94]:
df101

  nomeNovo coluna2  coluna3 teste1
0        a      aa        0   NULL
1        b      bb        0    2.0
0        a      aa        0   NULL
1        b      bb        0    2.0
0        a      aa        0   NULL
1        b      bb        0    2.0
0        a      aa        0   NULL
1        b      bb        0    2.0

In [97]:
df101.to_clipboard()

In [98]:
df101.to_clipboard(index = False)